In [25]:
import xlrd
import pandas as pd

In [26]:
im = pd.read_excel(r'cad_cam internal calculation.xlsx')
im.head()

,S.NO,REG NO,STUDENTS NAME,Seminar1,Seminar 2,IT1,IT2,Assignment1,Assignment2,Assignment3
0,1,18213076,SUBHASH.J,NaN,NaN,AB,5,NaN,NaN,NaN
1,2,18213080,SURYA.B,NaN,NaN,19,NaN,NaN,NaN,NaN
2,3,18213081,SURYA.R,NaN,NaN,AB,27,20.0,20.0,20.0
3,4,18213084,TARUN R,NaN,NaN,29,NaN,20.0,20.0,20.0
4,5,18213085,UDHAYAKIRAN R,NaN,NaN,28,20,20.0,20.0,20.0

In [27]:
internal1 = im.loc[im['IT1'].isna(),"STUDENTS NAME"]
internal1

14            ARUN J
27    HARIKRISHNAN M
40       MUKUNDHAN G
41     NANDHAKUMAR N
52        RAMASAMY C
58       SASIKUMAR S
Name: STUDENTS NAME, dtype: object

In [28]:
internal2 = im.loc[im['IT2'].isna(),"STUDENTS NAME"]
internal2

1              SURYA.B
3              TARUN R
10       PRAVEEN RAJ R
14              ARUN J
15        ASHOKKUMAR R
27      HARIKRISHNAN M
28        JEVANANDHA G
29         KALANITHI P
35            LOKESH R
40         MUKUNDHAN G
41       NANDHAKUMAR N
42      NANDHANKUMAR S
43       NANESHWARAN G
45            NAVEEN A
47      NAVEEN KUMAR A
48      PACHAIYAPPAN N
51         RAJENDRAN M
52          RAMASAMY C
53             RISHI M
55    SANTHOSH KUMAR S
56          SANTHOSH P
58         SASIKUMAR S
59              SIVA L
60            SUBASH P
61           TAMILAN R
62      THIRUKUMARAN S
66       VIJAYAKUMAR D
Name: STUDENTS NAME, dtype: object

In [31]:
assignment = im.loc[im['Assignment1'].isna(),"STUDENTS NAME"]
print('number of studentds not submitted the assignment: ',len(assignment))
assignment

number of studentds not submitted the assignment:  22

0          SUBHASH.J
1            SURYA.B
5          VIJAY A S
6       VINAYKUMAR R
9         YOHESH K V
10     PRAVEEN RAJ R
16          BALRAJ V
17         BHARATH N
19       CHENNARAJ V
22          DINESH G
24          DINESH R
27    HARIKRISHNAN M
34    LOKESH KUMAR S
35          LOKESH R
40       MUKUNDHAN G
45          NAVEEN A
46          NAVEEN G
47    NAVEEN KUMAR A
53           RISHI M
59            SIVA L
64         VASANTH M
67          VIKRAM K
Name: STUDENTS NAME, dtype: object

In [37]:
check_internal = input('enter your register number')
im["REG NO"]=im["REG NO"].astype(str)
internal =im.loc[im['REG NO']==check_internal]
internal

,S.NO,REG NO,STUDENTS NAME,Seminar1,Seminar 2,IT1,IT2,Assignment1,Assignment2,Assignment3
13,14,18284131,ARAVINDHAN R,NaN,NaN,32,17,20.0,20.0,20.0